
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 29 to add, 14 to change, 40 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.migration_vms_data2[&#34;prddartsmig02&#34;]
  * azurerm_managed_disk.migration_vms_data2[&#34;prddartsmig03&#34;]
  * azurerm_managed_disk.migration_vms_data2[&#34;prddartsmig04&#34;]
  * azurerm_managed_disk.migration_vms_data2[&#34;prddartsmig05&#34;]
  * azurerm_managed_disk.shared_disk
  * azurerm_network_interface.migration_vms2[&#34;prddartsmig02&#34;]
  * azurerm_network_interface.migration_vms2[&#34;prddartsmig03&#34;]
  * azurerm_network_interface.migration_vms2[&#34;prddartsmig04&#34;]
  * azurerm_network_interface.migration_vms2[&#34;prddartsmig05&#34;]
  * azurerm_storage_blob.quarantine-st[0]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsassess&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsassure&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsmig01&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsoracle&#34;]
  * azurerm_virtual_machine_data_disk_attachment.vm1_attachment[&#34;prddartsunstr&#34;]
  * azurerm_windows_virtual_machine.migration_windows2[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows2[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows2[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows2[&#34;prddartsmig05&#34;]
  * module.sa-migration-quarantine[0].azurerm_private_endpoint.this[0]
  * module.sa-migration-quarantine[0].azurerm_storage_container.container[&#34;darts-quarantine&#34;]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig02&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig02&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig03&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig03&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig04&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig04&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig05&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms2[&#34;prddartsmig05&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
* Update
  * azurerm_linux_virtual_machine.dock-linux[&#34;prddartsmigdock&#34;]
  * azurerm_linux_virtual_machine.gitlab-linux[&#34;prddartsgitlab&#34;]
  * azurerm_linux_virtual_machine.migration[0]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdb01&#34;]
  * azurerm_linux_virtual_machine.migration-linux2[&#34;prddartsmigdb02&#34;]
  * azurerm_linux_virtual_machine.oracle[&#34;prddartsmigora01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassess&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassure&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsoracle&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsunstr&#34;]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-migration-quarantine[0].azurerm_storage_account.storage_account
* Delete
  * azurerm_backup_protected_vm.vm[&#34;prddartsmig02&#34;]
  * azurerm_backup_protected_vm.vm[&#34;prddartsmig03&#34;]
  * azurerm_backup_protected_vm.vm[&#34;prddartsmig04&#34;]
  * azurerm_backup_protected_vm.vm[&#34;prddartsmig05&#34;]
  * azurerm_managed_disk.migration_vms_data[&#34;prddartsmig02&#34;]
  * azurerm_managed_disk.migration_vms_data[&#34;prddartsmig03&#34;]
  * azurerm_managed_disk.migration_vms_data[&#34;prddartsmig04&#34;]
  * azurerm_managed_disk.migration_vms_data[&#34;prddartsmig05&#34;]
  * azurerm_network_interface.migration_vms[&#34;prddartsmig02&#34;]
  * azurerm_network_interface.migration_vms[&#34;prddartsmig03&#34;]
  * azurerm_network_interface.migration_vms[&#34;prddartsmig04&#34;]
  * azurerm_network_interface.migration_vms[&#34;prddartsmig05&#34;]
  * azurerm_storage_share.dets-file-share[0]
  * azurerm_virtual_machine_data_disk_attachment.migration_vms_datadisk[&#34;prddartsmig02&#34;]
  * azurerm_virtual_machine_data_disk_attachment.migration_vms_datadisk[&#34;prddartsmig03&#34;]
  * azurerm_virtual_machine_data_disk_attachment.migration_vms_datadisk[&#34;prddartsmig04&#34;]
  * azurerm_virtual_machine_data_disk_attachment.migration_vms_datadisk[&#34;prddartsmig05&#34;]
  * azurerm_virtual_machine_extension.migration_windows_joinad[&#34;prddartsmig02&#34;]
  * azurerm_virtual_machine_extension.migration_windows_joinad[&#34;prddartsmig03&#34;]
  * azurerm_virtual_machine_extension.migration_windows_joinad[&#34;prddartsmig04&#34;]
  * azurerm_virtual_machine_extension.migration_windows_joinad[&#34;prddartsmig05&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig05&#34;]
  * module.sa_dets[0].azapi_update_resource.defender_settings
  * module.sa_dets[0].azurerm_private_endpoint.this[0]
  * module.sa_dets[0].azurerm_storage_account.storage_account
  * module.sa_dets[0].random_string.storage_account_random_string
  * module.sa_dets[0].time_rotating.rotate
  * module.sa_dets[0].time_static.pim_expiry
  * module.sa_dets[0].time_static.pim_start
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig02&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig02&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig03&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig03&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig04&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig04&#34;].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig05&#34;].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig05&#34;].azurerm_virtual_machine_extension.azure_monitor[0]


<details><summary>Change Result (Click me)</summary>

:warning: **The content is omitted as it is too long.** :warning:

```hcl

  # azurerm_backup_protected_vm.vm["prddartsmig02"] will be destroyed
  # (because key ["prddartsmig02"] is not in for_each map)
  - resource "azurerm_backup_protected_vm" "vm" {
      - backup_policy_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupPolicies/darts-prod-policy" -> null
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig02/protectedItems/VM;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig02" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "darts-prod-rsv" -> null
      - resource_group_name = "darts-migration-prod-rg" -> null
      - source_vm_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02" -> null
    }

  # azurerm_backup_protected_vm.vm["prddartsmig03"] will be destroyed
  # (because key ["prddartsmig03"] is not in for_each map)
  - resource "azurerm_backup_protected_vm" "vm" {
      - backup_policy_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupPolicies/darts-prod-policy" -> null
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig03/protectedItems/VM;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig03" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "darts-prod-rsv" -> null
      - resource_group_name = "darts-migration-prod-rg" -> null
      - source_vm_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03" -> null
    }

  # azurerm_backup_protected_vm.vm["prddartsmig04"] will be destroyed
  # (because key ["prddartsmig04"] is not in for_each map)
  - resource "azurerm_backup_protected_vm" "vm" {
      - backup_policy_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupPolicies/darts-prod-policy" -> null
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig04/protectedItems/VM;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig04" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "darts-prod-rsv" -> null
      - resource_group_name = "darts-migration-prod-rg" -> null
      - source_vm_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04" -> null
    }

  # azurerm_backup_protected_vm.vm["prddartsmig05"] will be destroyed
  # (because key ["prddartsmig05"] is not in for_each map)
  - resource "azurerm_backup_protected_vm" "vm" {
      - backup_policy_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupPolicies/darts-prod-policy" -> null
      - id                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig05/protectedItems/VM;iaasvmcontainerv2;darts-migration-prod-rg;prddartsmig05" -> null
      - protection_state    = "Protected" -> null
      - recovery_vault_name = "darts-prod-rsv" -> null
      - resource_group_name = "darts-migration-prod-rg" -> null
      - source_vm_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05" -> null
    }

  # azurerm_linux_virtual_machine.dock-linux["prddartsmigdock"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "dock-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock"
        name                                                   = "prddartsmigdock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.gitlab-linux["prddartsgitlab"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "gitlab-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsgitlab"
        name                                                   = "prddartsgitlab"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                                                   = "migration-vm"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdb01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb01"
        name                                                   = "prddartsmigdb01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux2["prddartsmigdb02"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux2" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb02"
        name                                                   = "prddartsmigdb02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.oracle["prddartsmigora01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "oracle" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigora01"
        name                                                   = "prddartsmigora01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_managed_disk.migration_vms_data["prddartsmig02"] will be destroyed
  # (because key ["prddartsmig02"] is not in for_each map)
  - resource "azurerm_managed_disk" "migration_vms_data" {
      - create_option                     = "Empty" -> null
      - disk_iops_read_only               = 0 -> null
      - disk_iops_read_write              = 2300 -> null
      - disk_mbps_read_only               = 0 -> null
      - disk_mbps_read_write              = 150 -> null
      - disk_size_gb                      = 500 -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig02-datadisk" -> null
      - location                          = "uksouth" -> null
      - max_shares                        = 0 -> null
      - name                              = "prddartsmig02-datadisk" -> null
      - on_demand_bursting_enabled        = false -> null
      - optimized_frequent_attach_enabled = false -> null
      - performance_plus_enabled          = false -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "darts-migration-prod-rg" -> null
      - storage_account_type              = "Premium_LRS" -> null
      - tags                              = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - tier                              = "P20" -> null
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (13 unchanged attributes hidden)
    }

  # azurerm_managed_disk.migration_vms_data["prddartsmig03"] will be destroyed
  # (because key ["prddartsmig03"] is not in for_each map)
  - resource "azurerm_managed_disk" "migration_vms_data" {
      - create_option                     = "Empty" -> null
      - disk_iops_read_only               = 0 -> null
      - disk_iops_read_write              = 2300 -> null
      - disk_mbps_read_only               = 0 -> null
      - disk_mbps_read_write              = 150 -> null
      - disk_size_gb                      = 500 -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig03-datadisk" -> null
      - location                          = "uksouth" -> null
      - max_shares                        = 0 -> null
      - name                              = "prddartsmig03-datadisk" -> null
      - on_demand_bursting_enabled        = false -> null
      - optimized_frequent_attach_enabled = false -> null
      - performance_plus_enabled          = false -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "darts-migration-prod-rg" -> null
      - storage_account_type              = "Premium_LRS" -> null
      - tags                              = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - tier                              = "P20" -> null
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (13 unchanged attributes hidden)
    }

  # azurerm_managed_disk.migration_vms_data["prddartsmig04"] will be destroyed
  # (because key ["prddartsmig04"] is not in for_each map)
  - resource "azurerm_managed_disk" "migration_vms_data" {
      - create_option                     = "Empty" -> null
      - disk_iops_read_only               = 0 -> null
      - disk_iops_read_write              = 2300 -> null
      - disk_mbps_read_only               = 0 -> null
      - disk_mbps_read_write              = 150 -> null
      - disk_size_gb                      = 500 -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig04-datadisk" -> null
      - location                          = "uksouth" -> null
      - max_shares                        = 0 -> null
      - name                              = "prddartsmig04-datadisk" -> null
      - on_demand_bursting_enabled        = false -> null
      - optimized_frequent_attach_enabled = false -> null
      - performance_plus_enabled          = false -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "darts-migration-prod-rg" -> null
      - storage_account_type              = "Premium_LRS" -> null
      - tags                              = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - tier                              = "P20" -> null
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (13 unchanged attributes hidden)
    }

  # azurerm_managed_disk.migration_vms_data["prddartsmig05"] will be destroyed
  # (because key ["prddartsmig05"] is not in for_each map)
  - resource "azurerm_managed_disk" "migration_vms_data" {
      - create_option                     = "Empty" -> null
      - disk_iops_read_only               = 0 -> null
      - disk_iops_read_write              = 2300 -> null
      - disk_mbps_read_only               = 0 -> null
      - disk_mbps_read_write              = 150 -> null
      - disk_size_gb                      = 500 -> null
      - id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/prddartsmig05-datadisk" -> null
      - location                          = "uksouth" -> null
      - max_shares                        = 0 -> null
      - name                              = "prddartsmig05-datadisk" -> null
      - on_demand_bursting_enabled        = false -> null
      - optimized_frequent_attach_enabled = false -> null
      - performance_plus_enabled          = false -> null
      - public_network_access_enabled     = true -> null
      - resource_group_name               = "darts-migration-prod-rg" -> null
      - storage_account_type              = "Premium_LRS" -> null
      - tags                              = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - tier                              = "P20" -> null
      - trusted_launch_enabled            = false -> null
      - upload_size_bytes                 = 0 -> null
        # (13 unchanged attributes hidden)
    }

  # azurerm_managed_disk.migration_vms_data2["prddartsmig02"] will be created
  + resource "azurerm_managed_disk" "migration_vms_data2" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 500
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "prddartsmig02-datadisk"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tags                              = {
          + "application"         = "darts"
          + "builtFrom"        

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

meric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "k905tq0p2zs1jg1am2mav9fs" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.sa_dets[0].time_rotating.rotate will be destroyed
  # (because time_rotating.rotate is not in configuration)
  - resource "time_rotating" "rotate" {
      - day              = 7 -> null
      - hour             = 14 -> null
      - id               = "2024-11-12T14:36:22Z" -> null
      - minute           = 36 -> null
      - month            = 11 -> null
      - rfc3339          = "2024-11-12T14:36:22Z" -> null
      - rotation_days    = 360 -> null
      - rotation_rfc3339 = "2025-11-07T14:36:22Z" -> null
      - second           = 22 -> null
      - unix             = 1762526182 -> null
      - year             = 2025 -> null
    }

  # module.sa_dets[0].time_static.pim_expiry will be destroyed
  # (because time_static.pim_expiry is not in configuration)
  - resource "time_static" "pim_expiry" {
      - day     = 7 -> null
      - hour    = 14 -> null
      - id      = "2025-11-07T14:36:22Z" -> null
      - minute  = 36 -> null
      - month   = 11 -> null
      - rfc3339 = "2025-11-07T14:36:22Z" -> null
      - second  = 22 -> null
      - unix    = 1762526182 -> null
      - year    = 2025 -> null
    }

  # module.sa_dets[0].time_static.pim_start will be destroyed
  # (because time_static.pim_start is not in configuration)
  - resource "time_static" "pim_start" {
      - day     = 12 -> null
      - hour    = 14 -> null
      - id      = "2024-11-12T14:36:22Z" -> null
      - minute  = 36 -> null
      - month   = 11 -> null
      - rfc3339 = "2024-11-12T14:36:22Z" -> null
      - second  = 22 -> null
      - unix    = 1731422182 -> null
      - year    = 2024 -> null
    }

  # module.vm-bootstrap-migration_vms["prddartsmig02"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig02"] is not in configuration)
  - resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      - data_collection_rule_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs" -> null
      - description                 = "Association between a windows VM and the appropriate data collection rule." -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02/providers/Microsoft.Insights/dataCollectionRuleAssociations/vm-prddartsmig02-dcra" -> null
      - name                        = "vm-prddartsmig02-dcra" -> null
      - target_resource_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig02"].azurerm_virtual_machine_extension.azure_monitor[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig02"] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02/extensions/AMAWindows" -> null
      - name                        = "AMAWindows" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Monitor" -> null
      - tags                        = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - type                        = "AzureMonitorWindowsAgent" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02" -> null
    }

  # module.vm-bootstrap-migration_vms["prddartsmig03"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig03"] is not in configuration)
  - resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      - data_collection_rule_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs" -> null
      - description                 = "Association between a windows VM and the appropriate data collection rule." -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03/providers/Microsoft.Insights/dataCollectionRuleAssociations/vm-prddartsmig03-dcra" -> null
      - name                        = "vm-prddartsmig03-dcra" -> null
      - target_resource_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig03"].azurerm_virtual_machine_extension.azure_monitor[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig03"] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03/extensions/AMAWindows" -> null
      - name                        = "AMAWindows" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Monitor" -> null
      - tags                        = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - type                        = "AzureMonitorWindowsAgent" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03" -> null
    }

  # module.vm-bootstrap-migration_vms["prddartsmig04"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig04"] is not in configuration)
  - resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      - data_collection_rule_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs" -> null
      - description                 = "Association between a windows VM and the appropriate data collection rule." -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04/providers/Microsoft.Insights/dataCollectionRuleAssociations/vm-prddartsmig04-dcra" -> null
      - name                        = "vm-prddartsmig04-dcra" -> null
      - target_resource_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig04"].azurerm_virtual_machine_extension.azure_monitor[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig04"] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04/extensions/AMAWindows" -> null
      - name                        = "AMAWindows" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Monitor" -> null
      - tags                        = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - type                        = "AzureMonitorWindowsAgent" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04" -> null
    }

  # module.vm-bootstrap-migration_vms["prddartsmig05"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig05"] is not in configuration)
  - resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      - data_collection_rule_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs" -> null
      - description                 = "Association between a windows VM and the appropriate data collection rule." -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05/providers/Microsoft.Insights/dataCollectionRuleAssociations/vm-prddartsmig05-dcra" -> null
      - name                        = "vm-prddartsmig05-dcra" -> null
      - target_resource_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05" -> null
        # (1 unchanged attribute hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig05"].azurerm_virtual_machine_extension.azure_monitor[0] will be destroyed
  # (because module.vm-bootstrap-migration_vms["prddartsmig05"] is not in configuration)
  - resource "azurerm_virtual_machine_extension" "azure_monitor" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05/extensions/AMAWindows" -> null
      - name                        = "AMAWindows" -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Monitor" -> null
      - tags                        = {
          - "application"         = "darts"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "production"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - type                        = "AzureMonitorWindowsAgent" -> null
      - type_handler_version        = "1.9" -> null
      - virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05" -> null
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig02"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig02"].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig03"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig03"].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig04"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig04"].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig05"].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.vm-bootstrap-migration_vms2["prddartsmig05"].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "darts"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "production"
          + "managedBy"           = "Darts Modernisation"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

Plan: 29 to add, 14 to change, 40 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":334,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->